from django.shortcuts import render
from accounts.models import User
#---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
city = ["خالی","تهران","شیراز","شیراز","اهواز","تهران","تهران","بوشهر","خالی","شیراز","قزوین","تهران","تهران","شیراز","شیراز","مشهد","اهواز","خالی","کرمان","خالی","خالی","گرگان","شیراز","خالی","شیراز","تهران","خالی","شیراز","بوشهر","بوشهر","بوشهر","بندر لنگه,""اصفهان","بهبهان","یزد","تهران","شیراز","شیراز","تهران","خالی","شهرکرد","نورآباد","بوشهر","اندونزی","تهران","تهران","تهران","سراوان","تهران","شیراز","شیراز","شیراز","تهران","تهران","شیراز","شیراز","شیراز","شیراز","شیراز","سنندج","قشم","شیراز","تهران","تهران","تهران","تهران","اهواز","تهران","تهران","تهران","تهران","تهران","مشهد","تهران","گیلان","کرج","بندرعباس","تهران","تهران","تهران","مشهد","تهران","تهران","تهران","تهران","تهران","تبریز","تهران","تهران","تهران","تهران","برلین","تهران","تهران","تهران","تهران","تهران","تهران","تهران","تهران","تهران","تهران","تهران","تهران",
]
#---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
names = ["محمد فاضل لطفی","مونا افشار","سورن کرمی","زهرا علامه","مهسا خسروکیانی","احسان قاسمی","فرزاد ابراهیمی","رضا افشین","محسن مسرت","مریم احمدی","فرزانه حاجی زاده","مرتضی تیموری","سیاوش میرواحدی","ارمین آهنچین","محمدرضا روشن","سلمان افزد","فردوس مزرعاوی","وحید","رضا منظری","علیرضا افشار","محمد","علی قربانی","علی مسعودنیا","امین ایرانمنش","یاسمن فیروزی","مرتضی علی اصغری","پویا گیلانی","مازیار حیدری","علی صالحی","محمد رضا موسوی","علیرضاحیدری","نجلا وحدانی","محمد سجادی","زهرا آببخش","سامان برزگر","محسن دادگر","نازنین نصیری","پوریا قاسمی","عرفان یوسفی","امیررضا یار","محمدمهدی معتمدی","علیرضا انصاری","علی حاجب","نشفناخاد","سبحان دودانگه","اکرم مرادی","آرین","محمد آنیل","امیر انوشه","پارسا مکارم","علی طهماسبی","روزبه حاجی زاده","علیرضا تقوایی","امیر خزایی","شهراد گزنی","شادمهر قاسمی","نازنین رضایی","محمدامین آهنین","بهراد روشن راد","سینا مظفری","حذیفه صالحی پور","محمدمهدی رحیمی","بنیتا بابایی","آناشید بابایی","آریو عسکری","عباس معینی","ساینا","محمدرضا شریفی","علیرضا اسماعیلی","مهدی رحمتی","فربد مقدمی","امیرحسین پنجعلی","احسان زد","مهدی حیدری","نیما اکبری","علی نجاتیه","محمد اسکورپین","نیما قدیمی","پارسا بنایی","عرفان تنها","فاطمه موسوی","مهیار حسن زاده","مهدی جوانی","امیرحسین یحیوی","مجید چاچه ای","سامان محمدی","مهدی عبداللهی","مسعود فرهنگ","ابولفضل اقراری","ماهان خوشنیت","مهدی عبدی","امیرعلی بیگدلی","علیرضا  مرادی","امیرحسین سرافزار","عارف شکری","مهراب جعفری","علیرضا فلاحتی","علیرضا زینلی","دانیال جمالی","کوروش شکارچی","امیرحسین عیسی پور","ایلیا صحرایی","شایان مهرزاده","محمدمهدی چراکار",]

names2 = ["مریم ماری","سعید امامی","عرفان کالندی","پارسا وظیفه","امیرعلی ستوده","فرزان رحمانی","صادق زارعیان","کسرا جیبی","علی وانتزمور","نگین باقی","صالح پژند","مبین برفی","محمد شامخی","ایدا نجفی","سپهر رضوی","پارسا کنگاوری","هنگامه ا","کتایون قربانی","رضا ابسولوت","ارمین افضلی","یزدان فراهانی","مهدی معرف","ریحانه ا" ,"بهاره کاووسی","قرزان مسیبی","صدرا دادخواه","رضا حضوری","طاهر ا","مهدی معدنی","محمدرضا تاجیک","کوشا لاهوتی","محمدحسین ا","صادق ل","ابولفضل ل","امیر سلیمی","محمد خسروابادی","علی کمالی","علی صمدیفرد","آرمان زرکلام","علی علیزاده","پرهام سلطانی","علی رستمی","برکه ل","مهدی موسویان","پوریا پورنوین","مبینا اسماعیلی","حسین اولیا","عرفان همتی","حمیدرضا منتظر","هومن حقی","امیرحسین حنیفه","رضا یزدی","میلاد لیری",]


#---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


def createusers(request):
    for i in range(114,166):
        user = User(username=i,password=i,name = names2[i-114])
        user.save()


    return render(request,'panel/AdminHome.html')
#---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
import xlwt
from datetime import datetime
from django.http import HttpResponse
from urllib import response

def Export_Excel(request):
    response = HttpResponse(content_type="application/vnd.ms-excel")
    response["content-Dosposition"] = 'attachment;filename=persons' + str(datetime.now()) + '.xlsx'

    workbook = xlwt.Workbook(encoding="utf-8")
    worksheet = workbook.add_sheet("Persons")
    columns = ['username','name', 'city','reason']
    row_number = 0

    fontstyle = xlwt.XFStyle()
    fontstyle.font.bold = True

    for col in range(len(columns)):
        worksheet.write(row_number,col,columns[col],fontstyle)
    
    persons = User.objects.all()

    dataSheet = {}
    for person in persons:
        dataSheet[person.username] = [person.username,person.name, person.city.name,person.reason]

    for person in dataSheet:
        row_number += 1
        for col in range(len(columns)):
            worksheet.write(row_number,col,dataSheet[person][col])

    workbook.save(response)

    return response
