from django.shortcuts import render
from accounts.models import User
#---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
city = ["خالی","تهران","شیراز","شیراز","اهواز","تهران","تهران","بوشهر","خالی","شیراز","قزوین","تهران","تهران","شیراز","شیراز","مشهد","اهواز","خالی","کرمان","خالی","خالی","گرگان","شیراز","خالی","شیراز","تهران","خالی","شیراز","بوشهر","بوشهر","بوشهر","بندر لنگه,""اصفهان","بهبهان","یزد","تهران","شیراز","شیراز","تهران","خالی","شهرکرد","نورآباد","بوشهر","اندونزی","تهران","تهران","تهران","سراوان","تهران","شیراز","شیراز","شیراز","تهران","تهران","شیراز","شیراز","شیراز","شیراز","شیراز","سنندج","قشم","شیراز","تهران","تهران","تهران","تهران","اهواز","تهران","تهران","تهران","تهران","تهران","مشهد","تهران","گیلان","کرج","بندرعباس","تهران","تهران","تهران","مشهد","تهران","تهران","تهران","تهران","تهران","تبریز","تهران","تهران","تهران","تهران","برلین","تهران","تهران","تهران","تهران","تهران","تهران","تهران","تهران","تهران","تهران","تهران","تهران",
]
#---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
names = ["محمد فاضل لطفی","مونا افشار","سورن کرمی","زهرا علامه","مهسا خسروکیانی","احسان قاسمی","فرزاد ابراهیمی","رضا افشین","محسن مسرت","مریم احمدی","فرزانه حاجی زاده","مرتضی تیموری","سیاوش میرواحدی","ارمین آهنچین","محمدرضا روشن","سلمان افزد","فردوس مزرعاوی","وحید","رضا منظری","علیرضا افشار","محمد","علی قربانی","علی مسعودنیا","امین ایرانمنش","یاسمن فیروزی","مرتضی علی اصغری","پویا گیلانی","مازیار حیدری","علی صالحی","محمد رضا موسوی","علیرضاحیدری","نجلا وحدانی","محمد سجادی","زهرا آببخش","سامان برزگر","محسن دادگر","نازنین نصیری","پوریا قاسمی","عرفان یوسفی","امیررضا یار","محمدمهدی معتمدی","علیرضا انصاری","علی حاجب","نشفناخاد","سبحان دودانگه","اکرم مرادی","آرین","محمد آنیل","امیر انوشه","پارسا مکارم","علی طهماسبی","روزبه حاجی زاده","علیرضا تقوایی","امیر خزایی","شهراد گزنی","شادمهر قاسمی","نازنین رضایی","محمدامین آهنین","بهراد روشن راد","سینا مظفری","حذیفه صالحی پور","محمدمهدی رحیمی","بنیتا بابایی","آناشید بابایی","آریو عسکری","عباس معینی","ساینا","محمدرضا شریفی","علیرضا اسماعیلی","مهدی رحمتی","فربد مقدمی","امیرحسین پنجعلی","احسان زد","مهدی حیدری","نیما اکبری","علی نجاتیه","محمد اسکورپین","نیما قدیمی","پارسا بنایی","عرفان تنها","فاطمه موسوی","مهیار حسن زاده","مهدی جوانی","امیرحسین یحیوی","مجید چاچه ای","سامان محمدی","مهدی عبداللهی","مسعود فرهنگ","ابولفضل اقراری","ماهان خوشنیت","مهدی عبدی","امیرعلی بیگدلی","علیرضا  مرادی","امیرحسین سرافزار","عارف شکری","مهراب جعفری","علیرضا فلاحتی","علیرضا زینلی","دانیال جمالی","کوروش شکارچی","امیرحسین عیسی پور","ایلیا صحرایی","شایان مهرزاده","محمدمهدی چراکار",]
#---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


def createusers(request):
    for i in range(0,104):
        user = User(username=i,password=i,name = names[i])
        user.save()


    return render(request,'panel/AdminHome.html')

def addinfo(request):
    users = User.objects.all()
    return render(request,'panel/add_info.html',{'users' : users})


def home(request):
    users = User.objects.all()
    return render(request,'panel/AdminHome.html',{'users' : users})
